#사이킷런 
#사이킷런 파이썬 프레임 워크는 탄탄한 학습 알고리즘이 장점
#설치,학습,사용하기 쉽고 예제와 사용 설명서가 잘 돼있음
#딥러닝이나 강화학습을 다루지 않는 단점
#그래픽 모델과 시퀀스 예측 기능을 지원하지 않음
#파이썬 이외의 언어에서는 사용할 수 없고, 파이썬 JIT 컴하일러인 파이파이나 GPU를 지원하지 않음
#사이킷런은 분류와 회귀, 클러스터링,차원 축소,모델 선택, 전 처리에 대해 다양한 알고리즘을 지원,
#이와 관련된 문서와 예제도 훌륭하다
#하지만 이런 작업을 완료하기 위한 안내 워크플로우가 전혀 없음
#딥러닝이나 강화 학습을 지원하지 않아 정확한 이미지 분류와 신뢰성 있는 실시간 언어 구문 분석, 번역 같은 문제를
#해결하는 데는 적절치 않음
#여러 가지 다른 관측값을 연결하는 예측 함수를 만드는 것부터 관측값을 분류하는 것,라벨이 붙어있지 않은 데이터
#세트의 구조를 학습하는 것까지, 수 십개의 뉴런 계층이 필요 없는 일반적인 머신러닝 용도라면 사이킷만한 것이 없음
